app/controllers/api/v1/carwashes_controller.rb

SELECT "carwashes".* FROM "carwashes" WHERE "carwashes"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "11"]]
---
	def show
		@carwash = Carwash.find(params[:id])
		request_user_id = request.headers['User']
		@user = User.find(request_user_id)

SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? ORDER BY "cities"."id" ASC LIMIT 1  [["id", 1]]
---
	def index
		#@user = User.find_by(params[:id])
		request_city_id = request.headers['City']
		@city = City.find(request_city_id)