app/controllers/api/v1/favorites_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
---
	def index
		@user = User.find(params[:id])