app/controllers/api/v1/health_params_controller.rb

INSERT INTO "health_params" ("created_at", "pulse", "temperature", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 28 Mar 2017 22:23:09 UTC +00:00], ["pulse", "Alikhan"], ["temperature", "7057960015"], ["updated_at", Tue, 28 Mar 2017 22:23:09 UTC +00:00]]
---
	def create
		health_param = HealthParam.create(create_params)