app/controllers/api/v1/schedules_controller.rb

SELECT "carwashes".* FROM "carwashes" WHERE "carwashes"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "boxes".* FROM "boxes" WHERE "boxes"."carwash_id" = ? AND (carwash_id = id)  [["carwash_id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."box_id" = ?  [["box_id", 1]]
---
	def show
		@carwash = Carwash.find(params[:id])
		id = @carwash.id
		@boxes = @carwash.boxes#.where("carwash_id = id")
		@orders = @boxes.orders.each