app/controllers/api/v1/sessions_controller.rb

SELECT "cities".* FROM "cities"
SELECT "car_types".* FROM "car_types"
---
	def index
		@cities = City.all
		@car_types = CarType.all

SELECT "users".* FROM "users" WHERE "users"."phone_number" = 7075441777 LIMIT 1
SELECT "cities".* FROM "cities"
SELECT "car_types".* FROM "car_types"
---
	def create
		user = User.find_by(phone_number: create_params[:phone_number])
		@cities = City.all
		@car_types = CarType.all