app/controllers/api/v1/users_controller.rb

	def create
		user = User.new(create_params)
		return api_error(status: 422, errors: user.errors) unless user.valid?

		user.save!
---
INSERT INTO "users" ("authentication_token", "car_type_id", "city_id", "created_at", "name", "password_digest", "phone_number", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)