app/controllers/carwashes_controller.rb

  def show
  	@carwash = Carwash.find(params[:id])
---
SELECT "carwashes".* FROM "carwashes" WHERE "carwashes"."id" = ? LIMIT 1  [["id", "3"]]

  def create
  	@carwash = Carwash.new(carwash_params)
  	if @carwash.save
---
INSERT INTO "carwashes" ("address", "city_id", "contacts", "created_at", "name", "password_digest", "phone_number", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)