app/controllers/cw_sessions_controller.rb

SELECT "carwashes".* FROM "carwashes" WHERE "carwashes"."phone_number" = 7017771530 LIMIT 1
---
	def create
		carwash = Carwash.find_by(phone_number: params[:cw_session][:phone_number])