app/controllers/sessions_controller.rb

	def create
		user = User.find_by(phone_number: params[:session][:phone_number])
---
SELECT "users".* FROM "users" WHERE "users"."phone_number" = 7075441777 LIMIT 1