app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
        @cities = City.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "cities".* FROM "cities" LIMIT 30 OFFSET 0